In [1]:
import findspark
findspark.init('/home/akshay/spark-3.5.1-bin-hadoop3')
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("spark_tutorials_1").getOrCreate()

24/06/14 17:19:20 WARN Utils: Your hostname, akshay-vm resolves to a loopback address: 127.0.1.1; using 10.0.2.15 instead (on interface enp0s3)
24/06/14 17:19:20 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/06/14 17:19:23 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
data = [
    (1, 'Alice', 'F', 50000),
    (2, 'Bob', 'M', 60000),
    (3, 'Charlie', 'M', 55000),
    (4, 'David', 'M', 62000),
    (5, 'Eve', 'F', 51000),
    (6, 'Fiona', 'F', 48000),
    (7, 'George', 'M', 59000),
    (8, 'Hannah', 'F', 54000),
    (9, 'Ian', 'M', 63000),
    (10, 'Jane', 'F', 52000),
    (11, 'Kevin', 'M', 58000),
    (12, 'Lily', 'F', 49000),
    (13, 'Mike', 'M', 64000),
    (14, 'Nora', 'F', 56000),
    (15, 'Oscar', 'M', 67000),
    (16, 'Pam', 'F', 53000),
    (17, 'Quinn', '', 61000),
    (18, 'Rachel', '', 57000),
    (19, 'Sam', 'M', 65000),
    (20, 'Tina', 'F', 59000)
]

In [3]:
schema = ["id","name","gender","salary"]

In [4]:
df = spark.createDataFrame(data=data, schema=schema)

In [5]:
df.show()

+---+-------+------+------+
| id|   name|gender|salary|
+---+-------+------+------+
|  1|  Alice|     F| 50000|
|  2|    Bob|     M| 60000|
|  3|Charlie|     M| 55000|
|  4|  David|     M| 62000|
|  5|    Eve|     F| 51000|
|  6|  Fiona|     F| 48000|
|  7| George|     M| 59000|
|  8| Hannah|     F| 54000|
|  9|    Ian|     M| 63000|
| 10|   Jane|     F| 52000|
| 11|  Kevin|     M| 58000|
| 12|   Lily|     F| 49000|
| 13|   Mike|     M| 64000|
| 14|   Nora|     F| 56000|
| 15|  Oscar|     M| 67000|
| 16|    Pam|     F| 53000|
| 17|  Quinn|      | 61000|
| 18| Rachel|      | 57000|
| 19|    Sam|     M| 65000|
| 20|   Tina|     F| 59000|
+---+-------+------+------+

alias function

In [6]:
from pyspark.sql.functions import col

In [7]:
df1 = df.select(col("id").alias("emp_id"), \
                col("name").alias("emp_name"), \
                col("gender").alias("emp_gender"), \
                col("salary").alias("emp_salary"), \
                )

In [8]:
df1.show()

+------+--------+----------+----------+
|emp_id|emp_name|emp_gender|emp_salary|
+------+--------+----------+----------+
|     1|   Alice|         F|     50000|
|     2|     Bob|         M|     60000|
|     3| Charlie|         M|     55000|
|     4|   David|         M|     62000|
|     5|     Eve|         F|     51000|
|     6|   Fiona|         F|     48000|
|     7|  George|         M|     59000|
|     8|  Hannah|         F|     54000|
|     9|     Ian|         M|     63000|
|    10|    Jane|         F|     52000|
|    11|   Kevin|         M|     58000|
|    12|    Lily|         F|     49000|
|    13|    Mike|         M|     64000|
|    14|    Nora|         F|     56000|
|    15|   Oscar|         M|     67000|
|    16|     Pam|         F|     53000|
|    17|   Quinn|          |     61000|
|    18|  Rachel|          |     57000|
|    19|     Sam|         M|     65000|
|    20|    Tina|         F|     59000|
+------+--------+----------+----------+

asc and desc function

In [9]:
df2 = df.sort(col("salary").asc())
df2.show()

+---+-------+------+------+
| id|   name|gender|salary|
+---+-------+------+------+
|  6|  Fiona|     F| 48000|
| 12|   Lily|     F| 49000|
|  1|  Alice|     F| 50000|
|  5|    Eve|     F| 51000|
| 10|   Jane|     F| 52000|
| 16|    Pam|     F| 53000|
|  8| Hannah|     F| 54000|
|  3|Charlie|     M| 55000|
| 14|   Nora|     F| 56000|
| 18| Rachel|      | 57000|
| 11|  Kevin|     M| 58000|
|  7| George|     M| 59000|
| 20|   Tina|     F| 59000|
|  2|    Bob|     M| 60000|
| 17|  Quinn|      | 61000|
|  4|  David|     M| 62000|
|  9|    Ian|     M| 63000|
| 13|   Mike|     M| 64000|
| 19|    Sam|     M| 65000|
| 15|  Oscar|     M| 67000|
+---+-------+------+------+

In [10]:
df3 = df.sort(col("salary").desc())
df3.show()

+---+-------+------+------+
| id|   name|gender|salary|
+---+-------+------+------+
| 15|  Oscar|     M| 67000|
| 19|    Sam|     M| 65000|
| 13|   Mike|     M| 64000|
|  9|    Ian|     M| 63000|
|  4|  David|     M| 62000|
| 17|  Quinn|      | 61000|
|  2|    Bob|     M| 60000|
|  7| George|     M| 59000|
| 20|   Tina|     F| 59000|
| 11|  Kevin|     M| 58000|
| 18| Rachel|      | 57000|
| 14|   Nora|     F| 56000|
|  3|Charlie|     M| 55000|
|  8| Hannah|     F| 54000|
| 16|    Pam|     F| 53000|
| 10|   Jane|     F| 52000|
|  5|    Eve|     F| 51000|
|  1|  Alice|     F| 50000|
| 12|   Lily|     F| 49000|
|  6|  Fiona|     F| 48000|
+---+-------+------+------+

cast function

In [11]:
df.printSchema()

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

In [12]:
df4 = df.select(col("id").cast("int"), col("name"), col("gender"), col("salary"))
df4.printSchema()

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

In [13]:
from pyspark.sql.types import LongType

In [14]:
df4 = df.select(col("id").cast(LongType()), col("name"), col("gender"), col("salary"))
df4.printSchema()

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

like function

In [20]:
df5 = df.filter(col("name").like("M%"))
df5.show()

+---+----+------+------+
| id|name|gender|salary|
+---+----+------+------+
| 13|Mike|     M| 64000|
+---+----+------+------+